## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.tftest2-mjw-mtasts.azurerm_cdn_frontdoor_custom_domain.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "mta-sts" {
      + cdn_frontdoor_profile_id = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/test-afd-mta-sts"
      + dns_zone_id              = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-dnszones/providers/Microsoft.Network/dnsZones/tfttest2.matthewjwhite.co.uk"
      + expiration_date          = (known after apply)
      + host_name                = "mta-sts.tfttest2.matthewjwhite.co.uk"
      + id                       = (known after apply)
      + name                     = "cdnmwtftest2mtasts"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.tftest2-mjw-mtasts.azurerm_cdn_frontdoor_custom_domain_association.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "mta-sts" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.tftest2-mjw-mtasts.azurerm_cdn_frontdoor_endpoint.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "mta-sts" {
      + cdn_frontdoor_profile_id = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/test-afd-mta-sts"
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "cdnmwtftest2mtasts"
    }

  # module.tftest2-mjw-mtasts.azurerm_cdn_frontdoor_origin.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_origin" "mta-sts" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = false
      + enabled                        = true
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "example-origin"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 1
    }

  # module.tftest2-mjw-mtasts.azurerm_cdn_frontdoor_origin_group.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "mta-sts" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/test-afd-mta-sts"
      + id                                                        = (known after apply)
      + name                                                      = "cdnmwtftest2mtasts"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.tftest2-mjw-mtasts.azurerm_cdn_frontdoor_route.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_route" "mta-sts" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = (known after apply)
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpsOnly"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "cdnmwtftest2mtasts"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]
    }

  # module.tftest2-mjw-mtasts.azurerm_dns_cname_record.mta-sts will be created
  + resource "azurerm_dns_cname_record" "mta-sts" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mta-sts"
      + record              = (known after apply)
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 300
      + zone_name           = "tfttest2.matthewjwhite.co.uk"
    }

  # module.tftest2-mjw-mtasts.azurerm_dns_txt_record.dnsauth will be created
  + resource "azurerm_dns_txt_record" "dnsauth" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.mta-sts"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 300
      + zone_name           = "tfttest2.matthewjwhite.co.uk"

      + record {
          + value = (known after apply)
        }
    }

  # module.tftest2-mjw-mtasts.azurerm_dns_txt_record.mta-sts will be created
  + resource "azurerm_dns_txt_record" "mta-sts" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_mta-sts"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 300
      + zone_name           = "tfttest2.matthewjwhite.co.uk"

      + record {
          + value = "v=STSv1; id=16cd7c51ba418e1b5486b2ddcc27809f"
        }
    }

  # module.tftest2-mjw-mtasts.azurerm_dns_txt_record.smtp-tls will be created
  + resource "azurerm_dns_txt_record" "smtp-tls" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_smtp._tls"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 300
      + zone_name           = "tfttest2.matthewjwhite.co.uk"

      + record {
          + value = "v=TLSRPTv1; rua=mailto:tls-reports@matthewjwhite.co.uk"
        }
    }

  # module.tftest2-mjw-mtasts.azurerm_storage_account.mta-sts will be created
  + resource "azurerm_storage_account" "mta-sts" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = false
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stmwtftest2mtasts"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "RG-WhiteFam-UKS"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days                     = 7
              + permanent_delete_enabled = false
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (sensitive value)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + sas_policy {
          + expiration_action = "Log"
          + expiration_period = "01.12:00:00"
        }

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.tftest2-mjw-mtasts.azurerm_storage_account_static_website.mta-sts will be created
  + resource "azurerm_storage_account_static_website" "mta-sts" {
      + error_404_document = "error.htm"
      + id                 = (known after apply)
      + index_document     = "index.htm"
      + storage_account_id = (known after apply)
    }

  # module.tftest2-mjw-mtasts.azurerm_storage_blob.error will be created
  + resource "azurerm_storage_blob" "error" {
      + access_tier            = (known after apply)
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "error.htm"
      + parallelism            = 8
      + size                   = 0
      + source_content         = "<html><head><title>Error Page</title></head><body><center><h1>Nothing to see</h1></center></body></html>"
      + storage_account_name   = "stmwtftest2mtasts"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.tftest2-mjw-mtasts.azurerm_storage_blob.index will be created
  + resource "azurerm_storage_blob" "index" {
      + access_tier            = (known after apply)
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "index.htm"
      + parallelism            = 8
      + size                   = 0
      + source_content         = "<html><head><title>Nothing to see</title></head><body><center><h1>Nothing to see</h1></center></body></html>"
      + storage_account_name   = "stmwtftest2mtasts"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.tftest2-mjw-mtasts.azurerm_storage_blob.mta-sts will be created
  + resource "azurerm_storage_blob" "mta-sts" {
      + access_tier            = (known after apply)
      + content_type           = "text/plain"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = ".well-known/mta-sts.txt"
      + parallelism            = 8
      + size                   = 0
      + source_content         = <<-EOT
            version: STSv1
            mode: testing
            mx: tftest2-mjw.mail.protection.outlook.com
            max_age: 86400
        EOT
      + storage_account_name   = "stmwtftest2mtasts"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```
</details>